Masmiseim36/nxpSDK/boards/evkmimxrt1064/ble_cypress_examples/wiced_bt_passthrough_4343W/pin_mux.h
/*
 * Copyright 2018-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< LPUART1 signal: TX */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
#define BOARD_INITPINS_SD0_VSELECT_GPIO                                    GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_SD0_VSELECT_PORT                                    GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_SD0_VSELECT_PIN                                       30U   /*!< GPIO2 pin index: 30 */

/* GPIO_AD_B1_04 (coord L12), UART3_CTS */
#define BOARD_INITPINS_UART3_CTS_PERIPHERAL                              LPUART3   /*!< Device name: LPUART3 */
#define BOARD_INITPINS_UART3_CTS_SIGNAL                                    CTS_B   /*!< LPUART3 signal: CTS_B */

/* GPIO_AD_B1_05 (coord K12), UART3_RTS */
#define BOARD_INITPINS_UART3_RTS_PERIPHERAL                              LPUART3   /*!< Device name: LPUART3 */
#define BOARD_INITPINS_UART3_RTS_SIGNAL                                    RTS_B   /*!< LPUART3 signal: RTS_B */

/* GPIO_AD_B1_06 (coord J12), UART3_TX */
#define BOARD_INITPINS_UART3_TX_PERIPHERAL                               LPUART3   /*!< Device name: LPUART3 */
#define BOARD_INITPINS_UART3_TX_SIGNAL                                        TX   /*!< LPUART3 signal: TX */

/* GPIO_AD_B1_07 (coord K10), UART3_RX */
#define BOARD_INITPINS_UART3_RX_PERIPHERAL                               LPUART3   /*!< Device name: LPUART3 */
#define BOARD_INITPINS_UART3_RX_SIGNAL                                        RX   /*!< LPUART3 signal: RX */

/* GPIO_AD_B1_08 (coord H13), BT_REG_ON */
#define BOARD_INITPINS_BT_REG_ON_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_BT_REG_ON_PORT                                      GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_BT_REG_ON_PIN                                         24U   /*!< GPIO1 pin index: 24 */

/* GPIO_AD_B1_02 (coord L11), UART2_TXD */
#define BOARD_INITPINS_UART2_TXD_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_UART2_TXD_SIGNAL                                       TX   /*!< LPUART2 signal: TX */

/* GPIO_AD_B1_03 (coord M12), UART2_RXD */
#define BOARD_INITPINS_UART2_RXD_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_UART2_RXD_SIGNAL                                       RX   /*!< LPUART2 signal: RX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
